Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/criminal_law/criminal_offences/classification_of_crimes_in_criminal_cases.html.txt.tmx
Source language: en
Languages: ga

source: Classification of crimes in criminal cases
ga: Coireanna a aicmiú i gcúiseanna coiriúla

source: A crime is defined in law in Ireland as an act which may be punished by the State
ga: De réir dlí na hÉireann, is í coir ná gníomhaíocht inphionóis

source: The way in which a criminal offence is investigated and prosecuted depends on the type of crime involved
ga: Déantar imscrúdú ar chion coiriúil agus déantar é a ionchúiseamh bunaithe ar an gcineál coire atá i gceist

source: For these purposes criminal offences may be described in different ways such as:
ga: Chun na críche seo, féadtar cionta coiriúla a aicmiú mar seo a leanas:

source: Summary and indictable offences
ga: Cionta Achomair agus Indíotáilte

source: There are two ways criminal offences can be tried in Irish law:
ga: Úsáidtear dhá mhodh chun cionta coiriúla a thriail in Éirinn:

source: • In the lower court (District Court) before a judge without a jury
ga: • I gcúirteanna áitiúla (Cúirt Dúiche), os comhair breithimh ach gan coiste dháréag a bheith i láthair

source: • In the higher courts (Circuit Criminal Court, Central Criminal Court) before a judge and jury
ga: • I gcúirteanna náisiúnta (An Chúirt Chuarda Choiriúil, An Phríomhchúirt Choiriúil) os comhair breithimh agus coiste dháréag

source: Summary and indictable offences indicate the manner in which these offences are tried or dealt with in the courts
ga: Léiríonn teideal na gcionta – cionta achomair agus indíotáilte – an tslí ina ndéantar na cionta seo a thriail nó a phlé sna cúirteanna

source: A summary offence is one which can only be dealt with by a judge sitting without a jury,that is the District Court, while an indictable offence is one which may be or must be tried before a judge and jury
ga: Caithfear cion achomair a phlé os comhair breithimh gan coiste dháréag a bheith i láthair - an Chúirt Dúiche - ach caithfear cion indíotáilte a thriail os comhair breithimh agus coiste dháréag

source: All common-law offences are held to be indictable offences as the common law did not distinguish or differentiate between indictable and non-indictable offences
ga: Féachtar ar chionta faoin dlí coiteann mar chionta indíotáilte, toisc nár leagadh amach difríochtaí idir cionta indíotáilte agus cionta neamhindíotáilte faoin dlí coiteann

source: However, criminal statutes or criminal laws passed into law by the Oireachtas do make a distinction between types of crimes and therefore differentiates on how different crimes will be dealt with by the courts
ga: Leagtar amach na difríochtaí seo áfach sna reachtanna nó sna dlíthe coiriúla a chur an Oireachtas i bhfeidhm. Soláthraíonn na hathruithe seo faisnéis ar na modhanna difriúla a n-úsáidtear sna cúirteanna chun déileáil le coireanna difriúla

source: When an offence is dealt with in a District Court, the judge is restricted in the length of sentence they can impose for any offence
ga: Nuair a dhéantar cion a phlé sa Chúirt Dúiche, níl cead ag an mbreitheamh pianbhreith ró-fhada a chur ar dhuine de bharr ciona amháin

source: The Criminal Justice Act 1984 (Section11) states that the maximum term of imprisonment that can be imposed by the District Court in respect of any number of offences for which sentence is passed at the same time cannot exceed 2 years
ga: De réir an Achta um Cheartas Coiriúil 1984 (Alt 11) níl cead ag an gCúirt Dúiche téarma príosúnachta de níos mó ná dhá bhliain a thabhairt do dhuine i leith ciona amháin nó níos mó ná cion amháin

source: Similarly, the District Court cannot exceed a maximum sentence of 1 year in respect of one offence
ga: Ar an gcuma chéanna, níl cead ag Cúirt Dúiche téarma príosúnachta de níos mó ná bliain amháin a thabhairt do dhuine i leith ciona amháin

source: Examples of summary offences are:
ga: Is iad seo a leanas roinnt chionta achomair:

source: • Public Order Offence – Begging in an intimidating or threatening manner
ga: • Cion Oird Phoiblí – Ag lorg déirce ar bhealach is cúis le himeagla nó le bagairt

source: The penalty for being found guilty of this offence is a class E fine or up to one month in prison or both a fine and a term of imprisonment
ga: Pionós de rang E fíneáil atá ciontach nó téarma príosúnachta de mí amháin, nó an dá rud

source: • Public Order Offence- Threatening abusive or insulting behaviour in a public place
ga: • Cion Oird Phoiblí – Iompar a d’fhéadfadh a bheith bagrach don bheatha, iompar aibheiseach nó maslaitheach in áit phoiblí

source: The penalty available to a judge where a person is found guilty of this offence is a class D fine or up to three months in prison or both a fine and a term of imprisonment
ga: Tá cead ag an mbreitheamh pionós de rang D fíneáil a thabhairt amach don té atá ciontach, nó téarma príosúnachta de thrí mhí, nó an dá rud

source: Are all indictable offences tried in the higher courts?
ga: An ndéantar cionta indíotáilte a thriail i gcúirteanna náisiúnta?

source: Indictable offences are those which may or must be tried on indictment before a judge and jury, that is, in the Circuit Court or the Central Criminal Court
ga: Is iad cionta indíotáilte ná cionta a fhéadfar nó a gcaithfear a thriail ar díotáil os comhair breithimh agus coiste dháréag – sa Chúirt Chuarda nó sa Phríomhchúirt Choiriúil

source: However, not all indictable offences are tried before a jury
ga: Ní dhéantar gach cion indíotáilte a thriail os comhair coiste dháréag áfach

source: Indictable offences can be divided into a number of categories
ga: Féadtar cionta indíotáilte a chur i roinnt chatagóirí difriúla

source: A) Offences which must always be tried on indictment
ga: A) Caithfear na cionta seo a leanas a thriail ar díotáil i gcónaí

source: There are a number of offences which must be tried before a judge and jury and these offences are listed in the Criminal Procedure Act 1967 and the Criminal Law (Rape) (Amendment) Act 1990. These include:
ga: Caithfear roinnt chionta a thriail os comhair breithimh agus coiste dháréag. Luaitear na cionta seo san Acht um Nós Imeachta Coiriúil 1967 agus san Acht um Dhlí Choiriúil (Éigniú) (Leasú) 1990, mar shampla:

source: • Offence under the Treason Act 1939
ga: • Cionta faoin Acht Um Thréas 1939

source: • Murder, attempted murder, conspiracy to murder
ga: • Dúnmharú, iarracht ar dhúnmharú, comhcheilg chun dúnmharú a dhéanamh

source: In addition to the above there are a number of offences which do not include an option to be dealt with in the District Court (summary disposal)
ga: I dteannta leis na cionta thuasluaite, ní fhéadtar roinnt chionta a thriail sa Chúirt Dúiche (achoimre a chur de láimh)

source: They must be dealt with on indictment. Examples of these are:
ga: Caithfear déileáil leis na cionta seo ar díotáil, mar shampla:

source: • Section 4 of the Non Fatal Offences Against the Person Act 1997 – Assault causing serious harm
ga: • Alt 4 den Acht um Chionta Neamh-Mharfacha in Aghaidh an Duine 1997 – Ionsaí tromchúiseach

source: The penalty on conviction on indictment is a fine or imprisonment for life or both
ga: Má dhéantar an té atá ciontach a chiontú, caithfear pionós a íoc, cuirtear príosúnacht lena shaol air nó an dá rud

source: The statute (or piece of law) does not allow for this offence to be dealt with summarily
ga: De réir an reachta (nó ailt dlí) seo, ní fhéadtar déileáil leis an gcion seo go hachomair

source: • Section 14 of the Criminal Justice (Public Order) Act 1994 - Riot
ga: • Alt 14 den Acht um Cheartas Coiriúil 1994 (Ord Poiblí) - Círéib

source: Again the offence can only be dealt with on indictment
ga: Caithfear déileáil leis an gcion seo ar díotáil

source: B) Offences which may be tried summarily or by indictment at the request of the Director of Public Prosecutions, the judge or the accused
ga: B) Cionta gur féidir iad a thriail go hachomair nó ar díotáil, ar iarratas ón Stiúrthóir Ionchúiseamh Poiblí, ón mbreitheamh nó ón duine cúisithe

source: Section 2 of the Criminal Justice Act 1951 as amended by the Criminal Justice (Miscellaneous Provisions) Act 1997 provides that offences listed in the First Schedule of the 1951 Act can be dealt with in the District Court if three conditions are met:
ga: Forálann Alt 2 den Acht um Cheartas Coiriúil 1951, arna leasú ag an Acht um Cheartas Coiriúil 1997 (Forálacha Speisialta), gur féidir déileáil leis na cionta a luaitear sa Chéad Sceideal den Acht 1951, sa Chúirt Dúiche nuair a chomhlíontar an trí choinníoll a leanas:

source: The court is of the opinion that the facts proved or alleged amount to a minor offence which the court feels is fit to be tried summarily (in the District Court)
ga: Bíonn an Chúirt den bharúil gur mionchion atá i gceist toisc na fíorais soiléire nó líomhanta atá ar fáil agus go bhféadfaí in ann an duine a thriail go hachomair (i gCúirt Dúiche)

source: The accused person, when told by the court of his/her right to be tried by a judge and a jury, does not object to being tried in the District Court, and
ga: Níl an duine cúisithe i gcoinne trialach sa Chúirt Dúiche, nuair a thugtar faisnéis dó/di faoina c(h)earta i leith trialach os comhair breitheamh agus coiste dháréag

source: The Director of Public Prosecutions (DPP) consents to the accused being tried summarily for such offence
ga: Tugann Stiúrthóir Ionchúiseamh Poiblí (DPP) cead do na cúirteanna an duine cúisithe a thriail go hachomair i leith ciona dá leithéid

source: In practice, the judge looks to see what the DPP has directed and then asks the prosecuting Garda for an outline of the facts of the case
ga: Déanann an breitheamh imscrúdú ar threoracha an DPP agus cuireann sé/sí ceist ar an Garda ionchúisimh achoimre a thabhairt ar fhíorais an cháis

source: The judge then decides whether or not they are willing to hear the case or send it forward to a higher court to be dealt with (indictment)
ga: Ansin, caithfear cinneadh a dhéanamh an cás a thriail roimh an Chúirt Dúiche nó é a chur ar aghaidh go cúirt níos airde (ar díotáil)

source: If the judge decides to hear the case in the District Court the accused is given an opportunity to choose whether to be dealt with in the District Court or the Circuit Court
ga: Má dhéantar an cás a thriail sa Chúirt Dúiche, is féidir leis an duine cúisithe roghnú a dhéanamh idir an Chúirt Dúiche agus an Chúirt Chuarda

source: Normally, if an accused is given this choice they elect to be dealt with in the District Court as the maximum penalty available to the District Judge is less than that available in the Circuit Court
ga: De ghnáth, is í an Chúirt Dúiche a roghnaíonn an duine cúisithe chun a c(h)ás a thriail, toisc go mbíonn pionós níos lú i gceist sa Chúirt Dúiche, i gcomparáid leis an gCúirt Chuarda

source: Examples of some of the offences listed in the First Schedule are:
ga: Is iad seo a leanas roinnt de na cionta a luaitear sa Chéad Sceideal:

source: • Offences under the Criminal Law Act 1997
ga: • Cionta faoin Acht um Dhlí Choiriúil 1997

source: • Offences under the Criminal Law (Rape) (Amendment) Act 1990
ga: • Cionta faoin Acht um Dhlí Choiriúil 1990 (Éigniú) (Leasú)

source: • Offences under the Criminal Justice (Theft and Fraud Offences) Act 2001
ga: • Cionta faoin Acht um Cheartas Coiriúil 2001 (Cionta Gada agus Calaoise)

source: C) Offences which may be tried either summarily or on indictment at the option of the Director of Public Prosecutions, subject to the agreement of the District Court judge
ga: C) Cionta gur féidir iad a thriail go hachomair nó ar díotáil, bunaithe ar rogha an Stiúrthóra Ionchúiseamh Poiblí, agus i gcomhaontú le breitheamh na Cúirte Dúiche

source: This procedure is the same as that outlined at (B) above but without the accused being given an option as to whether they want the case to be dealt with in the District or Circuit Court
ga: Tá an nós imeachta céanna i gceist anseo, a shainmhínítear i (B) thuas, ach amháin nach mbíonn cead ag an duine cúisithe roghnú a dhéanamh idir an Chúirt Dúiche agus an Chúirt Chuarda chun a c(h)ás a thriail

source: The offences in this category are created by statute and the statute or piece of law states the different punishments on summary conviction and on indictment
ga: Cruthaítear na cionta sa chatagóir seo de bhua reachta agus leagtar amach sa reacht nó san acht áirithe na pionóis dhifriúla a bhaineann le ciontú ar achomair nó ar díotáil

source: How this process works in practice is that the DPP issues instructions as to whether the offence should be dealt with in the District or Circuit Court
ga: Mar chuid den phróiseas seo, eisíonn an DPP treoracha chun an cion a thriail sa Chúirt Dúiche nó sa Chúirt Chuarda

source: If the DPP directs summary disposal (District Court), the District Court judge hears a summary of the facts from the prosecuting Garda and then decide if they will allow the case to be dealt with in their court
ga: Nuair a thugann an DPP treoir achomair (Cúirt Dúiche), déanann breitheamh na Cúirte Dúiche imscrúdú ar na bhfíorais ón Garda ionchúisimh chun cinneadh a dhéanamh an cás a thriail ina c(h)úirt féin nó i gcúirt eile

source: If the judge is not satisfied that the offence is a minor offence then they refuse jurisdiction (that is, refuses to deal with the case) and sends it forward to the Circuit Court to be dealt with on indictment
ga: Má cheapann an breitheamh gur tromchion atá i gceist, ní ghlacann sé/sí le dlínse (ní ghlacann sé/sí leis an gcás) agus chuirtear é ar aghaidh chuig an Chúirt Chuarda chun é a thriail ar díotáil

source: Article 38.2 of the Constitution of Ireland sets out that minor offences may be tried in courts of summary jurisdiction, that is, the District Court
ga: De réir Airteagail 38.2 de Bhunreacht na hÉireann féadtar mionchionta a thriail i gcúirteanna le dlínse achomair – an Chúirt Dúiche

source: There is no definition of what a minor offence is in the Constitution although they are most often set down by the actual law
ga: Ní thugtar cur síos ar mhionchion i mBunreacht na hÉireann, ach déantar é sin san acht iomchuí don chuid is mó

source: The distinction between the constitutional concepts of minor and non-minor offences equates more or less with the statutory distinction drawn between summary and indictable offences
ga: Tá an idirdhealú bunúsach céanna idir na coincheapa bunreachtúla, “mionchionta” agus “neamhmhionchionta”, agus idir na coincheapa reachtúla “cionta achomair” agus “cionta indíotáilte”

source: The Supreme Court has however considered the issue of what constitutes a minor offence
ga: Leagadh amach sa Chúirt Uachtarach áfach cad é mionchion

source: The most important case in this area is a case called Melling v Ó Mathghamhna IR 1
ga: Is é Melling v Ó Mathghamhna IR 1 an cás is tábhachtaí maidir leis an saincheist seo

source: In examining the criteria or rules when deciding whether an offence was minor the Supreme Court laid out the following test:
ga: Úsáideann an Chúirt Uachtarach na tástálacha seo a leanas chun scrúdú a dhéanamh ar na critéirí nó rialacha chun a fháil amach an é mionchion atá i gceist:

source: • The severity or seriousness of the punishment
ga: • Déine nó tromchúis an phionóis

source: • Moral guilt of the accused
ga: • Ciontacht mhorálta an duine cúisithe

source: • The law in 1937 when the Constitution was adopted, and
ga: • An dlí i 1937, nuair a glacadh leis an mBunreacht, agus

source: Of these four tests, it is undoubtable that the most important one is the severity or seriousness of the sentence
ga: Cinnte, is í an tástáil is tábhachtaí ná tromchúis nó déine na breithe

source: All that can be said with certainty is that an offence is minor where the punishment is less than six months imprisonment (Conroy v Attorney General IR 411), whereas an offence is non-minor where the punishment is two years or more (Mallon v Minister for Agriculture, Food and Forestry 1 IR 517)
ga: Is féidir linn a rá go bhfuil mionchion i gceist nuair a bhíonn ar dhuine níos lú ná 6 mhí a chaitheamh sa phríosún (Conroy v an tArd-Aighne IR 411), agus is neamhmhionchion é nuair a fhaigheann an duine cúisithe 2 bhliain nó níos mó sa phríosún (Mallon v an tAire Talmhaíochta, Bia agus Foraoiseachta 1 IR 517)

source: It appears, however, that the courts have come to the belief an offence with a maximum prison sentence of twelve months constitutes a minor offence
ga: Is léir áfach, go gceapann na cúirteanna gur mionchion atá i gceist nuair a fhaigheann an duine cúisithe pianbhreith phríosúnachta de 12 mí nó íos lú

source: It can be said as a result that any offence that carries a penalty of more than twelve months imprisonment is considered a non-minor offence
ga: Mar thoradh ar seo, is neamhmhionchion é nuair a bhíonn ar dhuine cúisithe níos mó ná 12 mí a chaitheamh i bpríosún

source: The Bail Act 1997 created a new distinction between serious and non-serious offences
ga: Leagadh amach difríochtaí nua idir tromchionta agus neamhthromchionta san Acht um Bhannaí 1997

source: The Act allows bail to be refused where an accused is charged with a serious offence and it can be established that the accused is likely to commit further serious offences if released on bail
ga: Tugann an Acht cead do na cúirteanna bannaí a dhiúltú i gcás tromchiona nó nuair a thaispeántar go bhfuil seans mór ann go mbeidh an duine cúisithe freagrach as tromchionta eile, má ligfear amach ar bhannaí iad

source: The Bail Act 1997 defines a serious offence as an offence for which a person, if convicted, could be imprisoned for 5 years or more
ga: De réir an Achta um Bhannaí 1997, bíonn tromchion i gceist nuair a bhíonn ar an duine cúisithe 5 bliana nó níos mó a chaitheamh sa phríosún

source: Arrestable and non-arrestable offences
ga: Cionta inghabhála agus neamhinghabhála

source: Just as the Bail Act 1997 created a distinction between serious and non-serious offences, the Criminal Law Act 1997 abolished the distinction between a felony and misdemeanour and created the arrestable/non-arrestable distinction
ga: Cruthaíodh na téarmaí tromchionta agus neamhthromchionta san Acht um Bhannaí 1997, agus cuireadh deireadh le húsáid na téarmaí “feileonacht” agus “oilghníomh”, agus bunaíodh cionta inghabhála agus neamhinghabhála san Acht um Dhlí Choiriúil 1997

source: The Act defines an arrestable offence as an offence for which a person could be punished by imprisonment for 5 years or more, similar to the definition of a serious offence mentioned above
ga: De réir an Achta, bíonn cion inghabhála i gceist nuair a bhíonn ar an duine cúisithe 5 bliana nó níos mó a chaitheamh sa phríosún. Tá an cion seo an-chosúil leis an tromchion thuasluaite

source: This distinction holds great importance for the Gardaí
ga: Tá an difríocht seo an-tábhachtach do na Gardaí

source: Section 4 of the Criminal Law Act 1997 allows a Garda to arrest without warrant any person whom the Garda, with reasonable cause, believes to be guilty of committing or having committed an arrestable offence
ga: Tugann Alt 4 den Acht um Dhlí Choiriúil 1997 cead do na Gardaí duine a ghabháil gan barántas nuair a bhíonn cúis réasúnach acu go bhfuil an duine seo ciontach as cion inghabhála

source: Any person arrested for such an arrestable offence (without a warrant) can be detained in a Garda station for a maximum period of 12 hours for questioning before being charged with an offence or being released
ga: Nuair a ghabháltar duine de bharr ciona inghabhála (gan barántas gabháil), féadtar iad a ghabháil agus a choimeád i stáisiún na nGardaí ar feadh 12 uaire nó níos lú, chun iad a cheistiú

source: Also, if you remain silent when questioned by Gardaí in certain circumstances, inferences can be drawn from your silence in any proceedings against you for an arrestable offence
ga: Má theipeann ort ceisteanna na nGardaí a fhreagairt i gcásanna áirithe, is féidir leis na Gardaí tátail a bhaint as seo má dhéantar an dlí a chur orthu de bharr ciona inghabhála

source: Further information on your right to silence is available here
ga: Cliceáil anseo chun breis faisnéise a fháil ar do cheart chun tosta
